// 1. Задать температуру в градусах по Цельсию, асчет идет по формуле Tf = (9 / 5) * Tc + 32, где Tf — температура по Фаренгейту, Tc — по Цельсию.

var celsia = prompt("Введите числом градусов по цельсии: ")
console.log((9 / 5) * celsia + 32 + " градуса по фаренгейту")


// 2. Объявить две переменные: admin и name. Записать в name строку "Василий"; Скопировать значение из name в admin. Вывести admin (должно вывестись «Василий»).

var name = prompt("Введите ваше имя: ")
var admin = name

console.log(admin)





// 3. * Чему будет равно JS-выражение 1000 + "108"?

// Ответ будет "1000108" потому что у строк есть метот конкатенации строк, сложения строк если хотябы один операнд будет являться строкой то и остальные преровня.тся к строковому типу




/* 4. * Самостоятельно разобраться с атрибутами тега script (async и defer).

Атрибут - async  означает, что скрипт абсолютно независим: если у нас есть несколько скриптов с async, они могут выполняться в любом порядке.
То, что первое загрузится – запустится в первую очередь!

Атрибут defer сообщает браузеру, что он должен продолжать обрабатывать страницу и загружать скрипт в фоновом режиме, а затем запустить этот скрипт, когда он загрузится.

*/